In [1]:
import pandas as pd

df_1 = pd.DataFrame('a',index=[1],columns=['A'])
df_1

   A
1  a

In [2]:
df_1 = pd.DataFrame(['a','b','c'],columns=['A'])
df_1

   A
0  a
1  b
2  c

In [3]:
df_1['B'] = ["A","B","C"]
df_1

   A  B
0  a  A
1  b  B
2  c  C

In [8]:
df_1['B']=[1,2,3]   #컬럼B의 내용 수정 
df_1

   A  B
0  a  1
1  b  2
2  c  3

In [10]:
df_1['B'] = "A"   #sql에서 update할 경우 where 안쓰면 다 바뀐 것과 같이 생각
df_1

   A  B
0  a  A
1  b  A
2  c  A

In [12]:
df_1['A']    #두 방법 동일한 결과 나옴 / A column 값 출력 할 경우 

df_1.A

0    a
1    b
2    c
Name: A, dtype: object

In [20]:
df_1.columns = ["a","b"]  #컬럼 바꾸기
df_1

        a  b
hey     a  A
you     b  A
stupid  c  A

In [21]:
df_1.index  = ["0","01","02"]  #인덱스 바꾸기 
df_1

    a  b
0   a  A
01  b  A
02  c  A

In [24]:
values = [["test1","20000"],["test2","30000"],["test3","10000"]]
columns = ["name","pay"]

df_2 = pd.DataFrame(values,columns = columns)
df_2

    name    pay
0  test1  20000
1  test2  30000
2  test3  10000

In [25]:
df_2.sort_values("pay")  #페이 오름차순으로 정렬

    name    pay
2  test3  10000
0  test1  20000
1  test2  30000

In [26]:
df_2.sort_values('pay', ascending = False)  # 내림차순으로

    name    pay
1  test2  30000
0  test1  20000
2  test3  10000

In [27]:
df_2.sort_index(ascending=False)  #sort->시간순으로 정렬 많이 함

    name    pay
2  test3  10000
1  test2  30000
0  test1  20000

In [28]:
df_3 = df_2.copy()   # data copy 
df_3

    name    pay
0  test1  20000
1  test2  30000
2  test3  10000

In [32]:
df_4 = df_3.drop(["name"],axis =1) # 축 삭제 (axis=0은 행을 삭제)
df_4

     pay
0  20000
1  30000
2  10000

In [44]:
df_5 = df_3.drop([0],axis=0)
df_5

    name    pay
1  test2  30000
2  test3  10000

In [45]:
df_5.to_csv('test.csv', encoding='utf-8')

#경로 지정('./'하위폴더명'/test.csv) 
#         ('../test.csv) : 상위폴더 'python'에 저장